In [2]:
import pandas as pd
import random
import numpy as np

## creating teachers dataframe

In [4]:
x = {"Teacher_name":['Sharvari', 'DhirajA', 'GH', 'KSB','MV','SJ','Neethu','Harshal','Manan','Vaibhav'],"Designation":["hod","teacher","teacher","teacher","teacher","teacher","teacher","teacher","teacher","teacher"],"Available"\
    :["No","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes","Yes"], "No_Duty":[0,6,3,3,3,3,3,3,6,6]}
df = pd.DataFrame(data = x)
df

  Available Designation  No_Duty Teacher_name
0        No         hod        0     Sharvari
1       Yes     teacher        6      DhirajA
2       Yes     teacher        3           GH
3       Yes     teacher        3          KSB
4       Yes     teacher        3           MV
5       Yes     teacher        3           SJ
6       Yes     teacher        3       Neethu
7       Yes     teacher        3      Harshal
8       Yes     teacher        6           MV
9       Yes     teacher        6           VM

In [5]:
df.to_csv("Teachers_data.csv")

In [6]:
def assign_counter(x):
    if x =="No" :
        return 1
    else:
        return 0
df["counter"] = df["Available"].map(assign_counter)
df

  Available Designation  No_Duty Teacher_name  counter
0        No         hod        0     Sharvari        1
1       Yes     teacher        3       Dhiraj        0
2       Yes     teacher        3      Gayatri        0
3       Yes     teacher        3   SureshBabu        0

In [9]:
m,n = df.shape
print("m =",m )
for i in range(0,10):
     print(random.randint(0,m))

m = 10
1
10
10
3
9
9
10
4
10
3

In [12]:
df.set_value(df[(df["Designation"]=="teacher") & (df["counter"] == 0)].index.values,"Available", "Yes")
df

  Available Designation  No_Duty Teacher_name  counter
0        No         hod        0     Sharvari        1
1       Yes     teacher        3       Dhiraj        0
2       Yes     teacher        3      Gayatri        0
3       Yes     teacher        3   SureshBabu        0

In [17]:
global lst
lst = ["Dhiraj"]
def to_avialable(x):
    global lst
    if x in lst :
        return "No"
    if df[df["Teacher_name"] == x]["Designation"].any() == "hod":
        return "No"
    return "Yes"
df["Available"] = df["Teacher_name"].map(to_avialable)
df

  Available Designation  No_Duty Teacher_name
0        No         hod        0     Sharvari
1        No     teacher        3       Dhiraj
2       Yes     teacher        3      Gayatri
3       Yes     teacher        3   SureshBabu

## function for assigning the duty

In [6]:
global count
count = sessions
def assign():
    global count
    while True:
        if count == 0:
            count = sessions
            df.set_value(df[df["Designation"]=="teacher" & df["counter"] == 0].index.values,"Available", "Yes")
            #df[df[Designation]=="teacher"]["Available"] = "Yes"
        
        if sum(df["No_Duty"]) == sum(df[df["Available"]=="No"]["No_Duty"]) or df["Available"].all == "No" :
            count -= 1
            print(count,"from if 1")
            return "x"
        
        i = random.randint(0,3)
        #print(i)
        
            
        if df.iloc[i]["Designation"] != "hod":
            
            if df.iloc[i]["Available"] == "Yes":
                
                if df.iloc[i]["No_Duty"] > 0:
                    
                    df.set_value(i,"No_Duty",df.iloc[i]["No_Duty"]-1)
                    df.set_value(i,"Available", "No")
                    count -= 1
                    print(count,"from if 2")
                    return df.iloc[i]["Teacher_name"]

NameError: name 'sessions' is not defined

## creating examduty dataframe (df2)

In [17]:
days = int(input("Enter number of days"))
sessions = int(input("Enter number of exam per day"))

Enter number of days5
Enter number of exam per day4

In [18]:
lst = []
for i in range(1,days+1):
    lst.append("Day"+str(i))

In [19]:
lst

['Day1', 'Day2', 'Day3', 'Day4', 'Day5']

In [20]:
lst1 = []
for i in range(1,sessions+1):
    lst1.append("Session"+str(i))
lst1

['Session1', 'Session2', 'Session3', 'Session4']

In [21]:
lst2 = []
for i in range(0,days):
    lst3 = []
    for j in range(0,sessions):
        lst3.append("NaN")
    lst2.append(lst3)
lst2

[['NaN', 'NaN', 'NaN', 'NaN'],
 ['NaN', 'NaN', 'NaN', 'NaN'],
 ['NaN', 'NaN', 'NaN', 'NaN'],
 ['NaN', 'NaN', 'NaN', 'NaN'],
 ['NaN', 'NaN', 'NaN', 'NaN']]

In [22]:
df2 = pd.DataFrame(data =lst2, columns = lst1)

In [23]:
df2["day"] = lst
df2.set_index("day", inplace = True)

In [24]:
 df2

     Session1 Session2 Session3 Session4
day
Day1      NaN      NaN      NaN      NaN
Day2      NaN      NaN      NaN      NaN
Day3      NaN      NaN      NaN      NaN
Day4      NaN      NaN      NaN      NaN
Day5      NaN      NaN      NaN      NaN

In [26]:
df2.index

Index(['Day1', 'Day2', 'Day3', 'Day4', 'Day5'], dtype='object', name='day')

## assign a duty i.e updating df2

In [27]:
df2.shape

(5, 4)

In [28]:
n, m =  df2.shape

In [31]:
for i in range(1,n+1):
    for j in range(1,m+1):
        t = assign()
        df2.set_value("Day"+str(i),"Session"+str(j), t)

3 from if 2
2 from if 2
1 from if 2
0 from if 1

TypeError: cannot compare a dtyped [int64] array with a scalar of type [bool]

In [32]:
df2

        Session1 Session2 Session3 Session4
day
Day1  SureshBabu  Gayatri   Dhiraj        x
Day2         NaN      NaN      NaN      NaN
Day3         NaN      NaN      NaN      NaN
Day4         NaN      NaN      NaN      NaN
Day5         NaN      NaN      NaN      NaN

In [33]:
df2.iloc[0]["Session1"]

'SureshBabu'

## creating teachers dataframe after assigning the duty (df3)

In [320]:
x,y = df.shape

In [340]:
lst5 = []
for i in range(0,x):
    lst5.append(df.get_value(i,"Teacher_name"))

lst5

['Sharvari', 'Dhiraj', 'Gayatri', 'SureshBabu']

In [341]:
lst4 = []
for i in range(0,x):
    lst6 = []
    for j in range(0,days):
        lst6.append("NaN")
    lst4.append(lst6)
lst4

[['NaN', 'NaN', 'NaN', 'NaN', 'NaN'],
 ['NaN', 'NaN', 'NaN', 'NaN', 'NaN'],
 ['NaN', 'NaN', 'NaN', 'NaN', 'NaN'],
 ['NaN', 'NaN', 'NaN', 'NaN', 'NaN']]

In [342]:
df3 = pd.DataFrame(data =lst4, columns = lst)

In [343]:
df3["Teacher_name"] = lst5
df3.set_index("Teacher_name", inplace = True)

In [344]:
df3

             Day1 Day2 Day3 Day4 Day5
Teacher_name
Sharvari      NaN  NaN  NaN  NaN  NaN
Dhiraj        NaN  NaN  NaN  NaN  NaN
Gayatri       NaN  NaN  NaN  NaN  NaN
SureshBabu    NaN  NaN  NaN  NaN  NaN

In [345]:
for i in range(1,days+1):
    for j in range(1,sessions+1):
            if df2.loc["Day"+str(i)]["Session"+str(j)] in df3.index.values:
                df3.set_value(df2.loc["Day"+str(i)]["Session"+str(j)],"Day"+str(i), "Session"+str(j))
                #print(df2.loc["Day"+str(i)]["Session"+str(j)],"Day"+str(i), "Session"+str(j),sep = "\t")

In [346]:
df3

                  Day1      Day2      Day3 Day4 Day5
Teacher_name
Sharvari           NaN       NaN       NaN  NaN  NaN
Dhiraj        Session3  Session2  Session2  NaN  NaN
Gayatri       Session2  Session1  Session3  NaN  NaN
SureshBabu    Session1  Session3  Session1  NaN  NaN